# Taps
tap "dotenvx/brew"
tap "derailed/k9s"
tap "withgraphite/tap"

# Casks
cask "1password"
cask "flox"
cask "google-drive"
cask "linearmouse"
cask "orbstack"
cask "slack"
cask "visual-studio-code"
cask "ghostty"

# Formulae (alphabetical)
brew "awscli"
brew "cmake"
brew "composer"
brew "direnv"
brew "doctl"
brew "dotenvx/brew/dotenvx"
brew "elixir"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-extras"
brew "go"
brew "helm"
brew "hey"
brew "httpie"
brew "jq"
brew "derailed/k9s/k9s"
brew "libmaxminddb"
brew "libxmlsec1"
brew "llvm"
brew "markdownlint-cli2"
brew "mergiraf"
brew "mise"
brew "mprocs"
brew "openssl"
brew "pngquant"
brew "readline"
brew "ripgrep"
brew "starship"
brew "ruff"
brew "rustup"
brew "swiftformat"
brew "tmux"
brew "tree"
brew "uv"
brew "vips"
brew "withgraphite/tap/graphite"
brew "wget"
brew "xz"
brew "ykman"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
